JUMP_ADDR_0
JUMP_ADDR_1
JUMP_ADDR_2
JUMP_ADDR_3
JUMP_ADDR_4
JUMP_ADDR_5
JUMP_ADDR_6
JUMP_ADDR_7
JUMP_ADDR_8
JUMP_ADDR_9
JUMP_ADDR_10
JUMP_ADDR_11
JUMP_ADDR_12
JUMP_ADDR_13
JUMP_ADDR_14
JUMP_ADDR_15
JUMP_ADDR_16
JUMP_ADDR_17
JUMP_ADDR_18
JUMP_ADDR_19
JUMP_ADDR_20
JUMP_ADDR_21
JUMP_ADDR_22
JUMP_ADDR_23
JUMP_ADDR_24
JUMP_ADDR_25
JUMP_ADDR_26
JUMP_ADDR_27
JUMP_ADDR_28
JUMP_ADDR_29
JUMP_ADDR_30
JUMP_ADDR_31
JUMP_ADDR_32
JUMP_ADDR_33
JUMP_ADDR_34
JUMP_ADDR_35
JUMP_ADDR_36
JUMP_ADDR_37
JUMP_ADDR_38
JUMP_ADDR_39
JUMP_ADDR_40
JUMP_ADDR_41
JUMP_ADDR_42
JUMP_ADDR_43
JUMP_ADDR_44
JUMP_ADDR_45
JUMP_ADDR_46
JUMP_ADDR_47
JUMP_ADDR_48
JUMP_ADDR_49
JUMP_ADDR_50
JUMP_ADDR_51
JUMP_ADDR_52
JUMP_ADDR_53
JUMP_ADDR_54
JUMP_ADDR_55
JUMP_ADDR_56
JUMP_ADDR_57
JUMP_ADDR_58
JUMP_ADDR_59
JUMP_ADDR_60
JUMP_ADDR_61
JUMP_ADDR_62
JUMP_ADDR_63
JUMP_ADDR_64
JUMP_ADDR_65
JUMP_ADDR_66
JUMP_ADDR_67
JUMP_ADDR_68
JUMP_ADDR_69
JUMP_ADDR_70
JUMP_ADDR_71
JUMP_ADDR_72
JUMP_ADDR_73
JUMP_ADDR_74
JUMP_ADDR_75
JUMP_ADDR_76
JUMP_ADDR_77
JUMP_ADDR_78
JUMP_ADDR_79
JUMP_ADDR_80
JUMP_ADDR_81
JUMP_ADDR_82
JUMP_ADDR_83
JUMP_ADDR_84
JUMP_ADDR_85
JUMP_ADDR_86
JUMP_ADDR_87
JUMP_ADDR_88
JUMP_ADDR_89
JUMP_ADDR_90
JUMP_ADDR_91
JUMP_ADDR_92
JUMP_ADDR_93
JUMP_ADDR_94
JUMP_ADDR_95
JUMP_ADDR_96
JUMP_ADDR_97
JUMP_ADDR_98
JUMP_ADDR_99
JUMP_ADDR_100
JUMP_ADDR_101
JUMP_ADDR_102
JUMP_ADDR_103
JUMP_ADDR_104
JUMP_ADDR_105
JUMP_ADDR_106
JUMP_ADDR_107
JUMP_ADDR_108
JUMP_ADDR_109
JUMP_ADDR_110
JUMP_ADDR_111
JUMP_ADDR_112
JUMP_ADDR_113
JUMP_ADDR_114
JUMP_ADDR_115
JUMP_ADDR_116
JUMP_ADDR_117
JUMP_ADDR_118
JUMP_ADDR_119
JUMP_ADDR_120
JUMP_ADDR_121
JUMP_ADDR_122
JUMP_ADDR_123
JUMP_ADDR_124
JUMP_ADDR_125
JUMP_ADDR_126
JUMP_ADDR_127
JUMP_ADDR_128
JUMP_ADDR_129
JUMP_ADDR_130
JUMP_ADDR_131
JUMP_ADDR_132
JUMP_ADDR_133
JUMP_ADDR_134
JUMP_ADDR_135
JUMP_ADDR_136
JUMP_ADDR_137
JUMP_ADDR_138
JUMP_ADDR_139
JUMP_ADDR_140
JUMP_ADDR_141
JUMP_ADDR_142
JUMP_ADDR_143
JUMP_ADDR_144
JUMP_ADDR_145
JUMP_ADDR_146
JUMP_ADDR_147
JUMP_ADDR_148
JUMP_ADDR_149
JUMP_ADDR_150
JUMP_ADDR_151
JUMP_ADDR_152
JUMP_ADDR_153
JUMP_ADDR_154
JUMP_ADDR_155
JUMP_ADDR_156
JUMP_ADDR_157
JUMP_ADDR_158
JUMP_ADDR_159
JUMP_ADDR_160
JUMP_ADDR_161
JUMP_ADDR_162
JUMP_ADDR_163
JUMP_ADDR_164
JUMP_ADDR_165
JUMP_ADDR_166
JUMP_ADDR_167
JUMP_ADDR_168
JUMP_ADDR_169
JUMP_ADDR_170
JUMP_ADDR_171
JUMP_ADDR_172
JUMP_ADDR_173
JUMP_ADDR_174
JUMP_ADDR_175
JUMP_ADDR_176
JUMP_ADDR_177
JUMP_ADDR_178
JUMP_ADDR_179
JUMP_ADDR_180
JUMP_ADDR_181
JUMP_ADDR_182
JUMP_ADDR_183
JUMP_ADDR_184
JUMP_ADDR_185
JUMP_ADDR_186
JUMP_ADDR_187
JUMP_ADDR_188
JUMP_ADDR_189
JUMP_ADDR_190
JUMP_ADDR_191
JUMP_ADDR_192
JUMP_ADDR_193
JUMP_ADDR_194
JUMP_ADDR_195
JUMP_ADDR_196
JUMP_ADDR_197
JUMP_ADDR_198
JUMP_ADDR_199
JUMP_ADDR_200
JUMP_ADDR_201
JUMP_ADDR_202
JUMP_ADDR_203
JUMP_ADDR_204
JUMP_ADDR_205
JUMP_ADDR_206
JUMP_ADDR_207
JUMP_ADDR_208
JUMP_ADDR_209
JUMP_ADDR_210
JUMP_ADDR_211
JUMP_ADDR_212
JUMP_ADDR_213
JUMP_ADDR_214
JUMP_ADDR_215
JUMP_ADDR_216
JUMP_ADDR_217
JUMP_ADDR_218
JUMP_ADDR_219
JUMP_ADDR_220
JUMP_ADDR_221
JUMP_ADDR_222
JUMP_ADDR_223
JUMP_ADDR_224
JUMP_ADDR_225
JUMP_ADDR_226
JUMP_ADDR_227
JUMP_ADDR_228
JUMP_ADDR_229
JUMP_ADDR_230
JUMP_ADDR_231
JUMP_ADDR_232
JUMP_ADDR_233
JUMP_ADDR_234
JUMP_ADDR_235
JUMP_ADDR_236
JUMP_ADDR_237
JUMP_ADDR_238
JUMP_ADDR_239
JUMP_ADDR_240
JUMP_ADDR_241
JUMP_ADDR_242
JUMP_ADDR_243
JUMP_ADDR_244
JUMP_ADDR_245
JUMP_ADDR_246
JUMP_ADDR_247
JUMP_ADDR_248
JUMP_ADDR_249
JUMP_ADDR_250
JUMP_ADDR_251
JUMP_ADDR_252
JUMP_ADDR_253
JUMP_ADDR_254
JUMP_ADDR_255
JUMP_ADDR_256
JUMP_ADDR_257
JUMP_ADDR_258
JUMP_ADDR_259
JUMP_ADDR_260
JUMP_ADDR_261
JUMP_ADDR_262
JUMP_ADDR_263
JUMP_ADDR_264
JUMP_ADDR_265
JUMP_ADDR_266
JUMP_ADDR_267
JUMP_ADDR_268
JUMP_ADDR_269
JUMP_ADDR_270
JUMP_ADDR_271
JUMP_ADDR_272
JUMP_ADDR_273
JUMP_ADDR_274
JUMP_ADDR_275
JUMP_ADDR_276
JUMP_ADDR_277
JUMP_ADDR_278
JUMP_ADDR_279
JUMP_ADDR_280
JUMP_ADDR_281
JUMP_ADDR_282
JUMP_ADDR_283
JUMP_ADDR_284
JUMP_ADDR_285
JUMP_ADDR_286
JUMP_ADDR_287
JUMP_ADDR_288
JUMP_ADDR_289
JUMP_ADDR_290
JUMP_ADDR_291
JUMP_ADDR_292
JUMP_ADDR_293
JUMP_ADDR_294
JUMP_ADDR_295
JUMP_ADDR_296
JUMP_ADDR_297
JUMP_ADDR_298
JUMP_ADDR_299
JUMP_ADDR_300
JUMP_ADDR_301
JUMP_ADDR_302
JUMP_ADDR_303
JUMP_ADDR_304
JUMP_ADDR_305
JUMP_ADDR_306
JUMP_ADDR_307
JUMP_ADDR_308
JUMP_ADDR_309
JUMP_ADDR_310
JUMP_ADDR_311
JUMP_ADDR_312
JUMP_ADDR_313
JUMP_ADDR_314
JUMP_ADDR_315
JUMP_ADDR_316
JUMP_ADDR_317
JUMP_ADDR_318
JUMP_ADDR_319
JUMP_ADDR_320
JUMP_ADDR_321
JUMP_ADDR_322
JUMP_ADDR_323
JUMP_ADDR_324
JUMP_ADDR_325
JUMP_ADDR_326
JUMP_ADDR_327
JUMP_ADDR_328
JUMP_ADDR_329
JUMP_ADDR_330
JUMP_ADDR_331
JUMP_ADDR_332
JUMP_ADDR_333
JUMP_ADDR_334
JUMP_ADDR_335
JUMP_ADDR_336
JUMP_ADDR_337
JUMP_ADDR_338
JUMP_ADDR_339
JUMP_ADDR_340
JUMP_ADDR_341
JUMP_ADDR_342
JUMP_ADDR_343
JUMP_ADDR_344
JUMP_ADDR_345
JUMP_ADDR_346
JUMP_ADDR_347
JUMP_ADDR_348
JUMP_ADDR_349
JUMP_ADDR_350
JUMP_ADDR_351
JUMP_ADDR_352
JUMP_ADDR_353
JUMP_ADDR_354
JUMP_ADDR_355
JUMP_ADDR_356
JUMP_ADDR_357
JUMP_ADDR_358
JUMP_ADDR_359
JUMP_ADDR_360
JUMP_ADDR_361
JUMP_ADDR_362
JUMP_ADDR_363
JUMP_ADDR_364
JUMP_ADDR_365
JUMP_ADDR_366
JUMP_ADDR_367
JUMP_ADDR_368
JUMP_ADDR_369
JUMP_ADDR_370
JUMP_ADDR_371
JUMP_ADDR_372
JUMP_ADDR_373
JUMP_ADDR_374
JUMP_ADDR_375
JUMP_ADDR_376
JUMP_ADDR_377
JUMP_ADDR_378
JUMP_ADDR_379
JUMP_ADDR_380
JUMP_ADDR_381
JUMP_ADDR_382
JUMP_ADDR_383
JUMP_ADDR_384
JUMP_ADDR_385
JUMP_ADDR_386
JUMP_ADDR_387
JUMP_ADDR_388
JUMP_ADDR_389
JUMP_ADDR_390
JUMP_ADDR_391
JUMP_ADDR_392
JUMP_ADDR_393
JUMP_ADDR_394
JUMP_ADDR_395
JUMP_ADDR_396
JUMP_ADDR_397
JUMP_ADDR_398
JUMP_ADDR_399
JUMP_ADDR_400
JUMP_ADDR_401
JUMP_ADDR_402
JUMP_ADDR_403
JUMP_ADDR_404
JUMP_ADDR_405
JUMP_ADDR_406
JUMP_ADDR_407
JUMP_ADDR_408
JUMP_ADDR_409
JUMP_ADDR_410
JUMP_ADDR_411
JUMP_ADDR_412
JUMP_ADDR_413
JUMP_ADDR_414
JUMP_ADDR_415
JUMP_ADDR_416
JUMP_ADDR_417
JUMP_ADDR_418
JUMP_ADDR_419
JUMP_ADDR_420
JUMP_ADDR_421
JUMP_ADDR_422
JUMP_ADDR_423
JUMP_ADDR_424
JUMP_ADDR_425
JUMP_ADDR_426
JUMP_ADDR_427
JUMP_ADDR_428
JUMP_ADDR_429
JUMP_ADDR_430
JUMP_ADDR_431
JUMP_ADDR_432
JUMP_ADDR_433
JUMP_ADDR_434
JUMP_ADDR_435
JUMP_ADDR_436
JUMP_ADDR_437
JUMP_ADDR_438
JUMP_ADDR_439
JUMP_ADDR_440
JUMP_ADDR_441
JUMP_ADDR_442
JUMP_ADDR_443
JUMP_ADDR_444
JUMP_ADDR_445
JUMP_ADDR_446
JUMP_ADDR_447
JUMP_ADDR_448
JUMP_ADDR_449
JUMP_ADDR_450
JUMP_ADDR_451
JUMP_ADDR_452
JUMP_ADDR_453
JUMP_ADDR_454
JUMP_ADDR_455
JUMP_ADDR_456
JUMP_ADDR_457
JUMP_ADDR_458
JUMP_ADDR_459
JUMP_ADDR_460
JUMP_ADDR_461
JUMP_ADDR_462
JUMP_ADDR_463
JUMP_ADDR_464
JUMP_ADDR_465
JUMP_ADDR_466
JUMP_ADDR_467
JUMP_ADDR_468
JUMP_ADDR_469
JUMP_ADDR_470
JUMP_ADDR_471
JUMP_ADDR_472
JUMP_ADDR_473
JUMP_ADDR_474
JUMP_ADDR_475
JUMP_ADDR_476
JUMP_ADDR_477
JUMP_ADDR_478
JUMP_ADDR_479
JUMP_ADDR_480
JUMP_ADDR_481
JUMP_ADDR_482
JUMP_ADDR_483
JUMP_ADDR_484
JUMP_ADDR_485
JUMP_ADDR_486
JUMP_ADDR_487
JUMP_ADDR_488
JUMP_ADDR_489
JUMP_ADDR_490
JUMP_ADDR_491
JUMP_ADDR_492
JUMP_ADDR_493
JUMP_ADDR_494
JUMP_ADDR_495
JUMP_ADDR_496
JUMP_ADDR_497
JUMP_ADDR_498
JUMP_ADDR_499
JUMP_ADDR_500
JUMP_ADDR_501
JUMP_ADDR_502
JUMP_ADDR_503
JUMP_ADDR_504
JUMP_ADDR_505
JUMP_ADDR_506
JUMP_ADDR_507
JUMP_ADDR_508
JUMP_ADDR_509
JUMP_ADDR_510
JUMP_ADDR_511
[UNK]
endbr64
sub
rsp
CONST
mov
rax
cs:xxx
test
jz
call
add
retn
push
jmp
rdi
[rbx+CONST]
callfunc_xxx
rbp
jnz
movapd
xmm0
movups
[r12]
[r12+CONST]
[rsp+arg_xxx]
cmp
r15
r12
rbx
fs:xxx
[rsp+CONST+var_xxx]
xor
eax
lea
[CONST_VAR+CONST]
[CONST_VAR]
rsi
jbe
edx
[rbx]
dl
[rax]
rcx
rep
rdx
[rdx+rax]
GLOBAL_VAR
pop
[rbp+CONST]
edi
r13
[rax+CONST]
sub_xxx
r14
[rsp+CONST]
[rsp+CONST_VAR]
r8
[rsp+rax+arg_xxx]
movzx
[r14]
al
[r13+CONST]
ebp
dil
movsx
bpl
off_xxx
ebx
imul
[r14+CONST]
dec
ja
UNK_ADDR
movsxd
ds:xxx
sil
[rax+rbp+CONST]
esi
or
lock
nop
loc_xxx
unk_xxx
shr
sar
pxor
movdqu
[rdx]
setz
setnz
xmm1
[rax+rax+CONST]
jle
[rax+rcx*8]
jge
jg
jb
[rdx+CONST]
movdqa
xmm2
shl
paddd
and
[rcx+rax*4]
[rcx+CONST]
[rcx]
[rdx+rbx*8]
[rdx+r13*8]
movd
xmm3
ecx
pshufd
[rdx+rax*4]
[rcx+rsi*4]
[rdx+rsi*4]
[rax+r13*8]
jnb
[rdx+rsi*8]
[r8+CONST]
movq
[rax+rbx]
punpcklqdq
[rdx+rbx*4]
[r14+rbx*4]
r14d
r15d
cmovnz
setb
cl
[r15]
[CONST_VAR+rdx+CONST]
[CONST_VAR+rdx]
[r15+r12]
movaps
cmova
cmovnb
r9
[r15+rbx*4]
[rcx+rbx*4]
[r15+rbx*8]
[rcx+rbx*8]
movsd
xmm5
xmm4
comisd
maxsd
xmm6
minsd
xmm7
movhpd
[rsp+var_xxx]
[rsp+var_xxx+CONST]
[rbp+var_xxx+CONST]
[rbp+var_xxx]
movupd
[rax+r12]
[r12+rax+CONST]
[rbp+rax+CONST]
[CONST_VAR+r12]
[rsp+CONST+arg_xxx]
[rsp+CONST+var_xxx+CONST]
psubq
[r15+CONST]
cmovg
r8d
[rax+r14]
[CONST_VAR+r14]
xchg
ax
jns
js
[rsp+CONST+CONST_VAR]
[r9]
cdqe
r12d
bl
r13d
[r13+r14+CONST]
[rax+rax*2]
movss
unpcklps
movlps
[r14+r13]
[r14+r13+CONST]
[r8]
jl
[CONST_VAR+r14+CONST]
r10
cmovb
r11
[r14+r10]
[r11+r12]
[rax+r13]
[rax+rcx]
[CONST_VAR+rax]
[CONST_VAR+r13]
cmovbe
[rcx+rcx*2]
[rax+rcx*4]
[rbx+rbx*2]
[r15+rax*4]
[CONST_VAR+rax*4]
[CONST_VAR+rax*4+CONST]
[r13+rbp+CONST]
[r15+rbp]
comiss
[rsp+rdx*8+CONST+var_xxx]
movhlps
movlhps
[rax+r15]
[CONST_VAR+r15]
sbb
[rdx+r12]
[rdx+rbp]
[r8+rdx]
[r13+rax+CONST]
[r12+rax]
[rbp+rdx+CONST]
[r9+rdx]
unpcklpd
unpckhpd
not
ucomisd
setbe
pandn
andpd
andnpd
orpd
cmplepd
movhps
[rdx+rcx]
[r14+rbp]
[r9+CONST]
[rdx+rax*8]
[rdx+r13]
[r10+CONST]
cmovns
[r11+rax*8]
r10d
[r11]
[rbp+rdx*8+CONST]
cqo
[rax+rdx]
[rcx+rdx*8]
[r15+r14]
r11d
[r10]
[CONST_VAR+rcx*8]
r9d
cmovz
cmovl
setl
setnle
[rsp+CONST+CONST_VAR+CONST]
[rcx+rax]
[rcx+rax+CONST]
[rax+rax]
cdq
idiv
[r8+rbp]
[r8+rax*4]
[CONST_VAR+rcx*4]
[CONST_VAR+rcx*8+CONST]
[rax+CONST_VAR]
[CONST_VAR+rbp]
[rbp+rax*4+CONST]
[r10+r11+CONST]
[rdx+rdx]
[rax+r12*4]
[r9+r11+CONST]
[rax+rbx*4]
[rbp+rax*8+CONST]
[rcx+CONST_VAR]
div
[r11+CONST_VAR+CONST]
[r9+CONST_VAR+CONST]
[rax+rdx*8]
[r15+r13]
[rcx+r12]
[rbp+rbp*2+CONST]
[r14+rdx*8]
[r14+r12]
[rcx+rsi*8]
[r14+rax*8]
[r9+rdx*4]
punpckldq
[r12+rdx*4]
[r12+rax*4]
[CONST_VAR+rdi*4]
[r8+rax]
setnbe
[CONST_VAR+rcx*4+CONST]
[r8+rcx*4]
[r9+rcx*4]
[CONST_VAR+CONST_VAR]
[r9+r10+CONST]
[CONST_VAR+rcx+CONST]
[CONST_VAR+rdx*4]
[r9+r9]
[CONST_VAR+r9*4]
[CONST_VAR+rsi*2]
[CONST_VAR+r10*8]
[CONST_VAR+rdx*8]
[CONST_VAR+r8*8]
[CONST_VAR+rsi*8]
[rdx+rdx+CONST]
[r13+r12+CONST]
r8b
[r13+r13*2+CONST]
[r12+rax*4+CONST]
[r12+rax*8]
[r12+r13*8]
[CONST_VAR+r9+CONST]
[CONST_VAR+r9]
[rbp+r12+CONST]
cvtsi2sd
mulsd
cvttsd2si
[r12+r13]
addsd
subsd
btc
[r8+CONST_VAR]
neg
[r13+r15+CONST]
[rdx+rdx*4]
[rcx+rsi*2+CONST]
[rax+r13*4]
[rax+rdx*4]
cmovge
cmovle
[r8+r13]
[r8+r15]
[rcx+rdx]
[rcx+r15]
[rdx+rcx*4]
[rax+rbx*8]
[r13+rbx+CONST]
adc
[rcx+rdx*4]
[rdx+rbp*8]
[r8+rcx]
[rcx+rdx+CONST]
[rax+rdx+CONST]
[r12+r15]
bsr
[rdx+rcx*8]
[rax+rdi*4]
[rax+rdi*8]
[r15+CONST_VAR]
[r15+CONST_VAR+CONST]
[CONST_VAR+r8]
[r8+rcx+CONST]
[r9+r11*8]
[r8+r12]
[r8+rbx*8]
[CONST_VAR+rbx*8]
[CONST_VAR+CONST_VAR+CONST]
[rax+rax*4]
[CONST_VAR+r15+CONST]
r15b
[rbx+r14*8]
[rbx+rax+CONST]
[r14+CONST_VAR]
[r14+CONST_VAR+CONST]
[r14+rcx+CONST]
r13b
[r12+rbp]
[r8+rdx*4+CONST]
[rax+rbp*4]
[r13+rbp*4+CONST]
[r13+rax*4+CONST]
[rbp+r15*4+CONST]
[rsp+rax+CONST+var_xxx]
[r11+rax*4]
[r9+rax*4]
[r12+rdx*8]
[rsp+rax*4+CONST+var_xxx]
r10b
[rbx+r12*8]
ud2
[rax+rax*2+CONST]
bt
[rbp+rbx+CONST]
[r10+r15]
[r15+r10]
[r15+rcx+CONST]
r9b
[r15+rcx]
[rbp+r15+CONST]
[rax+r10]
r14b
[r10+rdx]
[rdx+r10]
[rbp+r10+CONST]
[r14+rdx]
[r12+r14+CONST]
[r12+rcx]
mul
[r12+CONST_VAR]
[r12+rdx]
[r12+rbx]
[rsp+r8+CONST+var_xxx]
[rsp+CONST_VAR+CONST+var_xxx]
[r14+r9]
[r14+rax]
[r8+r8*2]
[rdx+rcx*2+CONST]
[rcx+rax*8]
[rax+rbp*8]
[rax+r12*8]
[rcx+r12*4]
[r12+r10]
[r11+CONST]
setnb
r12b
movmskpd
xorpd
jp
dx
fld
fstp
fst
fchs
fucomip
st
fabs
fxch
r10w
[r14+rax*4]
[CONST_VAR+r12*8]
[CONST_VAR+rax*8]
[r8+rdx*2+CONST]
[r8+rdx*2]
[CONST_VAR+r10]
r11b
[r8+rcx*2+CONST]
[r8+rcx*2]
[rax+rax*8]
[r14+r14*8]
[CONST_VAR+rdi*8]
[rcx+rcx*8]
[r13+rax*8+CONST]
[r8+r8*8]
[CONST_VAR+rsi*8+CONST]
[rdx+rdx*8]
[CONST_VAR+rbx]
cx
si
jo
mulss
addss
cvtsi2ss
addps
cvtps2pd
cvtss2sd
pcmpgtb
pand
por
psrldq
pcmpeqd
pmaxub
pminub
pshuflw
bh
ah
pmaxsw
pminsw
[CONST_VAR+rax*2]
pextrw
bp
r13w
psubusw
paddw
pcmpeqw
pcmpgtd
[rcx+r9*4]
cvtdq2pd
psubd
minss
maxss
shufps
[CONST_VAR+r11*8]
[rdx+rdx*2]
xmm8
xmm9
packuswb
psrlw
[rbp+rcx*4+CONST]
[rax+rcx*8+CONST]
[rax+r10*8]
[rdx+r9]
[rax+r11*8]
[rdx+rdi*8]
[rbx+rax]
[r13+r15*4+CONST]
[r13+r15*8+CONST]
[r12+r15*8]
[r12+r14*8]
[rbx+r14]
[r14+r15]
[rbx+r12]
[rax+r14*8]
[rax+rcx+CONST]
[r13+rdx+CONST]
cvtpd2ps
cmovs
subpd
divpd
mulpd
addpd
divsd
andps
ucomiss
[rax+rsi*4]
[r8+rcx*8]
[rcx+r12*8]
[r12+r12*2]
[r8+rdi*8]
[r8+rax*8]
[rax+r13+CONST]
subss
mulps
[r15+rcx*8]
[r8+r10*8]
[r8+rdx*8]
cvtsd2ss
[r10+r10*2]
[CONST_VAR+r9*8]
[rbx+rcx*8]
[r11+rcx*4]
[r8+r11]
[rax+r10*4]
[CONST_VAR+r12+CONST]
divss
cvttss2si
[CONST_VAR+r8*8+CONST]
[r9+r9*2]
[rax+r8]
[rax+r8+CONST]
[rax+rdx*4+CONST]
[r8+rsi*8+CONST]
[rcx+rsi*4+CONST]
[r8+r9*8]
[r9+r8*4+CONST]
setp
sqrtss
xorps
[r14+rcx]
[rax+rdx*8+CONST]
[rsp+CONST+arg_xxx+CONST]
[rax+rsi*8]
extrn
extrn_xxx
inc
[rbx+rax*8]
dh
[r8+rsi*8]
[rdx+rax*8+CONST]
[rcx+rax*8+CONST]
[CONST_VAR+rax+CONST]
[CONST_VAR+rax*8+CONST]
[CONST_VAR+r10*8+CONST]
[CONST_VAR+r9*8+CONST]
[r12+rbx*8]
[rbp+r14*8+CONST]
[r10+rax*8]
[rcx+r13]
r12w
r14w
[CONST_VAR+rcx]
ch
[rbx+r9*8]
[r12+rbp*8+CONST]
[rsp+rdx+CONST+var_xxx]
[r8+rax*8+CONST]
[r8+rbx*8+CONST]
[r15+rbp*8+CONST]
[rdx+r13*4]
[r8+r8*2+CONST]
[rcx+rbp*4]
[r14+r13*8+CONST]
[CONST_VAR+rdx*8+CONST]
[r9+rcx*8+CONST]
[r9+rax*8]
[rcx+rbx]
[rdx+rbx]
[r9+rsi*8]
[rcx+r14]
[r9+rax*8+CONST]
[r9+r13*8+CONST]
[rax+r15*8]
[rbp+rbx*8+CONST]
[rsp+rbp+CONST+var_xxx]
movddup
[r15+rbx*8+CONST]
[rsp+rcx+CONST+var_xxx]
[rdx+r12*4]
[r12+rax*8+CONST]
[r12+rbx*8+CONST]
[rbx+r15]
[rbx+r15+CONST]
[rcx+rcx]
[rbx+r14+CONST]
[r11+rax]
[r12+rbx+CONST]
[r10+r10*4]
[r9+r10*4]
[rbx+r12+CONST]
[rbp+r14+CONST]
[rbp+rdi*4+CONST]
[rbx+CONST_VAR]
paddq
[rdx+rsi*8+CONST]
[CONST_VAR+r14*8]
[rcx+rbp*8]
btr
[r15+r14+CONST]
[r15+rax*8]
[rbx+rdx]
[r12+r14*8+CONST]
[r10+rax*8+CONST]
[r10+rdx*8+CONST]
[r8+rcx*8+CONST]
[r14+rbp*8]
[CONST_VAR+rbp*8]
[r14+rbx*8]
[r13+r12*8+CONST]
[r14+rbx*8+CONST]
[CONST_VAR+r11*8+CONST]
[rcx+rdx*8+CONST]
[rbp+r15*8+CONST]
[r14+r15*8]
setnl
cmpnltsd
[r14+r15*4]
cmpnlesd
[rcx+rcx*2+CONST]
[rax+r9*8]
[r15+rdx*4]
[r12+rdx+CONST]
sqrtsd
[rsp+rax*8+CONST+var_xxx]
[r15+rbx*4+CONST]
[r12+rbx*4]
[rbp+rbx*4+CONST]
[r13+r14*4+CONST]
[r13+rbx*4+CONST]
[r12+r15*4+CONST]
[r12+r14*4+CONST]
[rbx+rax*4]
[rbx+rdx*4]
[r15+rax*4+CONST]
[r15+rsi*4+CONST]
[r13+CONST_VAR+CONST]
[r15+rcx*4+CONST]
[r13+rsi*4+CONST]
[r13+r8*4+CONST]
[r13+rcx*4+CONST]
cvttps2dq
cmpltps
punpckhdq
[r14+rdx*4]
[rbp+rsi*4+CONST]
[rbp+rdx*4+CONST]
[r11+r11*2]
[r15+r11+CONST]
[r11+r15+CONST]
[rbp+r11*4+CONST]
[r15+rdx+CONST]
[rdx+r15+CONST]
[r15+r15*2]
[rdx+rax*4+CONST]
[rcx+r15+CONST]
[r15+rax+CONST]
[rax+r15+CONST]
[rbp+r9*4+CONST]
[rbp+r8*4+CONST]
[CONST_VAR+rsi*4+CONST]
[rcx+rdi*8]
[r10+rdi*4]
[rcx+r8+CONST]
[r10+r9+CONST]
[rdx+r8+CONST]
[rax+r9+CONST]
[rdx+r12*8]
[rax+rbp]
[r10+rsi*4]
[r9+rsi*4]
[r8+rsi*4]
[r12+rsi*4]
[r14+rsi*4]
[r11+rsi*4]
[rbx+rsi*4]
[r15+rsi*4]
[r11+rbp*8]
[CONST_VAR+rsi*4]
[r15+rax]
[r15+r8]
[r8+r14]
[rbx+r12*8+CONST]
[r15+rax*8+CONST]
[r14+rax*8+CONST]
[r12+r9]
[rbp+rsi*8+CONST]
[r8+rdx*4]
[r14+r12*4]
[rbx+r12*4]
[r14+r13*4]
[r13+r12*4+CONST]
[rbx+r13*4]
[r15+r14*4]
[rbp+CONST_VAR]
[r14+r12*8]
[r15+r12*4]
[rcx+r8]
[rbp+rcx+CONST]
setle
[rbp+rdi*8+CONST]
[r11+rcx]
[r9+rcx]
[rbp+rcx*8+CONST]
subps
unpckhps
[rbp+rax*2+CONST]
[r13+rcx+CONST]
[rbx+rcx+CONST]
[rbp+CONST_VAR+CONST]
[r13+rbx*8+CONST]
[rax+rbx*8+CONST]
psrad
punpcklwd
punpckhwd
psubb
[rbx+r10+CONST]
[rbx+r10]
[r9+CONST_VAR]
[rbx+r11+CONST]
[rbx+r11]
[r13+r9+CONST]
[rax+r13*8+CONST]
cmpltsd
[rbx+CONST_VAR+CONST]
[rax+rax*4+CONST]
[CONST_VAR+rsi*2+CONST]
[CONST_VAR+rdi*2]
[r12+rsi*8]
[rsp+rax+CONST+CONST_VAR]
[rax+rbx+CONST]
shufpd
[rbp+rax+var_xxx]
[rbp+rdx+var_xxx]
[rbx+rax*8+CONST]
[rax+CONST_VAR+CONST]
jnp
[rdx+CONST_VAR]
setnp
[rdx+r14*8]
[rax+r14*4]
[rdx+r15]
[rdx+rax+CONST]
[rbp+r13+CONST]
[rdx+rcx*8+CONST]
[r13+r8*8+CONST]
[r13+rsi*8+CONST]
[rbx+rbx]
[rcx+rbx*2]
[rdx+rdi*4]
[rax+rdx*2]
[rax+rbx*2]
[r14+r14]
[rbp+rbp+CONST]
[rcx+rbp*2]
[rdx+rax*2]
[r8+r9]
[r8+r9+CONST]
[rcx+r9]
[rax+r9]
[r11+CONST_VAR]
[r9+r11]
[rcx+r11]
[rax+r11]
[rcx+r9+CONST]
[r10+CONST_VAR]
[rcx+r10]
[rcx+r10+CONST]
[rdx+r8]
[r9+r10]
[rcx+rax*2]
r11w
[r15+rdx]
r15w
[CONST_VAR+rbx+CONST]
[r8+rbx]
[r10+rax+CONST]
[rbx+rcx]
[rdx+rcx*2]
[r9+r12]
[rdx+r9+CONST]
[r11+rdx+CONST]
[rcx+CONST_VAR+CONST]
bx
[r15+rbx]
[r15+rbp*8]
[r15+r14*8]
[r15+rsi*8]
[r14+r14+CONST]
[rbx+rbp*8]
[rax+r14*2]
[r9+rax*2]
r8w
[CONST_VAR+rdx*2]
[r9+rdx*2]
[rcx+r8*8]
[r10+rcx]
[r8+r10]
[r8+r10+CONST]
[r9+rax]
[r11+r9]
[rdx+r10+CONST]
[r8+rax*4+CONST]
[r10+rbp+CONST]
[rbx+rbp+CONST]
[rdx+r9*4]
[rcx+r14*4]
[rcx+r13*4]
[rcx+r15*4]
[r10+rax*4]
[r10+rax]
[r9+rbp+CONST]
[r9+rbx+CONST]
[r10+r12+CONST]
[r8+r13*4]
[r9+r12*4]
[r8+r15*4]
[r9+r15*4]
[rbx+rax*4+CONST]
[r11+rax+CONST]
[CONST_VAR+r10*4]
[rdx+r14+CONST]
[r11+r13+CONST]
[r10+rax*4+CONST]
[r9+rax*4+CONST]
[r11+rbp+CONST]
[rcx+r11*4]
[CONST_VAR+r11*4]
[r13+r11*4+CONST]
[r12+r11*4+CONST]
[CONST_VAR+rbx*4]
[r10+rcx+CONST]
[r12+rsi*4+CONST]
[r8+r14*4]
[r8+rbp*4]
[r9+rbp*4]
[r9+r13*4]
[r12+rcx*4+CONST]
[r14+rax+CONST]
[r15+rcx*4]
[rbx+rcx*4]
[r11+rax*4+CONST]
[r15+r10*4]
[rbx+r11*4]
[r8+rax+CONST]
[r10+rdx*4]
[r14+r8*4]
[rbx+r8*4]
[r15+r8*4]
[r15+rdi*4]
[rdx+r10*4]
[rcx+rax*4+CONST]
[r13+r10*4+CONST]
[rdx+r8*4]
[rax+r11*4]
[rdx+r11*4]
[rcx+r10*4]
[r15+r13*4+CONST]
[rax+r9*4]
[r12+r13*4+CONST]
[r10+rbx+CONST]
[r14+rbx]
[r8+rbx*4]
[r9+rbx*4]
[r8+r10*4]
[r9+rdi*4]
[r12+rcx*4]
[r12+r11*4]
[rdx+r12+CONST]
[rdx+CONST_VAR+CONST]
[rdx+r13+CONST]
[r12+r13*4]
[r15+r13*4]
[rdx+rbp*4]
[r14+rbp*4]
[r15+rbp*4]
[rbx+rbp*4]
[rsp+r8*4+CONST+var_xxx]
r9w
di
[rdx+r14]
[rax+r14+CONST]
[rbx+rcx*4+CONST]
[rbx+rsi*4+CONST]
cmpnless
andnps
orps
[rbx+r8*4+CONST]
[rbx+r11*4+CONST]
[rbx+rdi*4+CONST]
[rbx+rdx*4+CONST]
[rbx+r10*4+CONST]
[r9+rbx]
[r13+rbp*8+CONST]
[r13+rcx*8+CONST]
[CONST_VAR+r8+CONST]
[r9+r14*8+CONST]
[rsp+rbx+CONST+var_xxx]
[rcx+rbp]
[rbx+r14*8+CONST]
[rbp+r12*4+CONST]
[r8+rbp*8]
[r12+rbp*8]
[rax+rdx*2+CONST]
[r14+rbx+CONST]
[rcx+rdx*2+CONST]
bswap
hlt
[rsp+CONST_VAR+CONST+CONST_VAR]
[rsp+rdx+CONST+CONST_VAR]
[r12+rcx*8]
[r12+rcx*8+CONST]
[r13+rdx*4+CONST]
[r12+rbx*4+CONST]
[CONST_VAR+rax*2+CONST]
[CONST_VAR+rcx*2+CONST]
[rbx+rdx+CONST]
[rax+rbx*4+CONST]
[rsp+r13*4+CONST+var_xxx]
pslldq
[rbx+rbx*4]
[rcx+rdx*2]
[r13+r8+CONST]
[rax+r10+CONST]
[rbx+r8]
[r14+rax*2+CONST]
[rbx+rbp]
[r8+rdx+CONST]
[r8+CONST_VAR+CONST]
[r9+r13+CONST]
[r8+r8*4]
[rax+rbp*2+CONST]
[r8+rax*2+CONST]
[r8+r9*2+CONST]
[r12+r12*4]
[rbx+rax*2+CONST]
[rbx+rdx*8+CONST]
[rbx+r12*4+CONST]
bts
[rsp+r14*4+CONST+var_xxx]
[rax+r12+CONST]
[rsp+rbx+CONST+CONST_VAR]
[CONST_VAR+rcx*2]
[r8+rbp*8+CONST]
[r13+rdx*8+CONST]
[rcx+rax*2+CONST]
[rdx+rax*2+CONST]
[rbx+r13]
[r12+r15+CONST]
[rdx+rdi*2]
[rdx+r11]
[r12+r14]
[r9+r9*4]
[rcx+rcx*4]
[r11+rdx*8]
[r15+r13*8]
[rbx+rcx*8+CONST]
[rcx+rbx*8+CONST]
[rbx+rbp*8+CONST]
[r12+rsi*8+CONST]
[r12+rdx*8+CONST]
[rbx+rsi*8+CONST]
[rax+r14*8+CONST]
[r9+r8]
[rdx+r9*8]
[r8+rdi*8+CONST]
[r12+r9*4]
[rbx+r14*4]
[rbx+r14*4+CONST]
[rcx+rsi*8+CONST]
[r13+r13+CONST]
[rbx+rbx+CONST]
[rbp+r13*8+CONST]
[r15+rdx*8]
[r12+CONST_VAR+CONST]
[rsp+r14+CONST+var_xxx]
[r8+r8+CONST]
[CONST_VAR+rbx*8+CONST]
[CONST_VAR+r14*8+CONST]
[rcx+r13*8+CONST]
[rcx+r14*8+CONST]
[rdx+r14*4]
[r15+rdx*8+CONST]
[rax+rbp*8+CONST]
[rdx+r14*8+CONST]
[rcx+r12*8+CONST]
[rcx+r15*8+CONST]
[rax+r12*8+CONST]
[r14+r15*8+CONST]
movlpd
[r12+r13*8+CONST]
[rdx+rbx*8+CONST]
[rbp+rbp*4+CONST]
[CONST_VAR+r13*8]
[rdx+rcx+CONST]
[rbx+rdx*8]
[rbx+rsi*8]
[r12+rdi*8]
[rdx+r8*8]
[rdx+r15*8]
[r15+r15*4]
[rax+r8*8]
[r10+rcx*8]
[r10+rdx*8]
[r11+r8*8]
[r11+rcx*8]
[r11+rsi*8]
[r8+r8]
[rcx+r8*4]
[r11+r10*8+CONST]
[r13+r9*4+CONST]
[rbx+r8*8]
[CONST_VAR+r8*4]
[r8+r11*8]
[rbp+r12*8+CONST]
[rbx+r13*8]
[rbp+r9*8+CONST]
[rbx+r10*8]
[r15+r9*8]
[r15+r10*8]
[rcx+r9*8]
[r12+r9*8]
[r10+rsi*8]
[r10+rdi*8]
[r10+r9*8]
[r10+r14]
[r9+rcx*8]
[r11+r9*8]
[r9+r10*8]
[r12+r12]
[r9+r12*8]
[r14+r8*8]
[r9+rdi*8]
[r9+r8*8]
[r9+r14]
[r12+r11*8]
[r13+rdi*8+CONST]
[r14+rdi*8]
[r14+rcx*8]
[r10+r8*8+CONST]
[r9+r15]
[r11+r11*4]
[r11+rdx*8+CONST]
[rax+r10*8+CONST]
[r11+r10*8]
[r11+rdi*8]
[r11+rbx*8]
[r14+r11*8]
[r11+r13*8]
[CONST_VAR+rbp*4]
[CONST_VAR+r15*4]
[CONST_VAR+r15*8]
[rcx+r15*8]
[r9+rdx*8+CONST]
[r9+r15*8+CONST]
[r14+rbp*8+CONST]
[r12+r12+CONST]
[r10+rcx*8+CONST]
[r13+r14*8+CONST]
[r11+rax*8+CONST]
[rsp+r15+CONST+var_xxx]
[r9+r12*8+CONST]
[r11+rbp*8+CONST]
[r9+r8+CONST]
[rcx+rdi*2]
err
rol
[r12+rdx*4+CONST]
[r12+rdi*4+CONST]
[r15+rbx+CONST]
[r15+rbp+CONST]
[r14+r13*8]
punpckhqdq
[rax+rsi*8+CONST]
[CONST_VAR+r12*8+CONST]
[r12+r13+CONST]
[rbp+r8*8+CONST]
[r8+r10*2]
[rax+rcx*2+CONST]
[rax+rdi*2+CONST]
[rdx+rsi*2+CONST]
[CONST_VAR+rdi*2+CONST]
[rsp+rax*8+CONST+CONST_VAR]
[rsp+rcx*8+CONST+CONST_VAR]
[rcx+r14*8]
[rbx+r15*8]
[rax+rbp*2]
[CONST_VAR+r9*2]
[r9+r10*2]
[rax+r9*2]
[rax+rdi*2]
[CONST_VAR+r8*2]
[rax+r8*4]
[r12+r12*4+CONST]
[r12+r12*2+CONST]
[r14+r15+CONST]
fldz
fcomip
fnstcw
fmul
fsub
fldcw
fistp
fsubrp
fld1
fdivp
fmulp
fucomi
fcomi
fdiv
[rsp+rax+CONST+var_xxx+CONST]
fdivrp
[r13+r13*4+CONST]
[rdx+rsi*2]
[r8+rsi*2+CONST]
[r11+r8]
[rsp+arg_xxx+CONST]
[r8+r15*8+CONST]
[r15+r14*8+CONST]
[r12+r15*8+CONST]
[r10+r14*8+CONST]
[rbp+arg_xxx]
[r11+rdx*4]
[CONST_VAR+r10+CONST]
[rcx+r12+CONST]
[rdx+rsi*4+CONST]
[rax+rcx*4+CONST]
[r13+rdi*4+CONST]
[CONST_VAR+r14*4]
[r11+r13]
[r10+rbx]
[r12+r10*4]
[r14+rcx*4]
[r12+r8]
[rbx+rdi*4]
[rcx+rdx*4+CONST]
[CONST_VAR+rdx*4+CONST]
[rdx+rcx*4+CONST]
[r11+r14*4]
[rcx+r8*4+CONST]
[r10+r13]
[r10+r13*4]
[r12+rbp*4]
[rbx+r13*8+CONST]
jno
[r10+r13*8+CONST]
[r15+r13*8+CONST]
[CONST_VAR+r13*4]
[r15+r12*8+CONST]
[r14+rcx*8+CONST]
[r10+r12*8+CONST]
[r14+r10*8+CONST]
[r15+rsi*8+CONST]
[rsp+r12+CONST+var_xxx]
[r10+rbp*8+CONST]
[rsp+r13+CONST+var_xxx]
locretxxx
[rbx+r15*8+CONST]
[r14+rsi*8+CONST]
[r14+r12*8+CONST]
[r11+r14*8+CONST]
[rdx+rbp*8+CONST]
[CONST_VAR+r13*8+CONST]
[r9+rbx*8+CONST]
[r15+rcx*8+CONST]
[r11+rbx*8+CONST]
[r8+r13*8+CONST]
[r14+rdx+CONST]
[rbx+rdx*2]
[CONST_VAR+rdx*2+CONST]
[rax+rbx*2+CONST]
[r11+r11+CONST]
[CONST_VAR+r11]
[rax+rcx*2]
[r15+r15]
[rax+r15*2]
[r14+r12+CONST]
[r13+rdx*2+CONST]
[rcx+rcx+CONST]
[rbx+rcx*2]
[r13+rax*2+CONST]
[rbx+rax*2]
[CONST_VAR+r13+CONST]
[rcx+rbx+CONST]
[rax+rsi*2+CONST]
[rbp+r8+CONST]
[CONST_VAR+r9*2+CONST]
[rbx+r9+CONST]
[r14+r14*4]
[rax+r8*2+CONST]
[CONST_VAR+r8*2+CONST]
[rbx+r8+CONST]
[rdx+rdx*2+CONST]
[rcx+r10*8]
[r10+r14*8]
[rdx+r11*8]
[r9+r9+CONST]
[r9+rdx*8]
[rax+rsi*2]
[r8+rax*2]
[r8+r11*4]
[rcx+rdi*4]
[rcx+rdi*4+CONST]
[rbp+r9+CONST]
punpcklbw
pcmpeqb
paddb
punpckhbw
psllw
psrld
pslld
[rcx+r13+CONST]
[rsp+rsi*8+CONST+var_xxx]
[rsp+rdx+CONST+CONST_VAR+CONST]
[rdx+r8*8+CONST]
[rdx+rbx+CONST]
[r12+rcx+CONST]
[r8+r14+CONST]
[r9+rdx+CONST]
[r9+rax+CONST]
[r12+r8*8]
[r13+r10+CONST]
[r14+r9*4]
[r15+r9]
[r13+r11+CONST]
[rcx+rbp+CONST]
[r8+r9*4]
[rax+r13*2]
[r14+rsi*8]
[rbp+rbx*2+CONST]
ss:xxx
cwde
[r14+rsi*2]
pinsrw
[r10+r8]
[r9+rcx+CONST]
[r14+r8]
[r13+rbx*2+CONST]
[rbp+rax*8+var_xxx]
[rbp+rdx*8+var_xxx]
[rbp+rsi*8+var_xxx]
[rbp+rcx*8+var_xxx]
[rax+r15*4]
[r14+r14*2]
[r10+r12]
[rbx+r13+CONST]
[r15+r12+CONST]
[rcx+rcx*4+CONST]
[CONST_VAR+rbp+CONST]
[r12+r11]
[r12+rax*2+CONST]
[rdx+r13*2+CONST]
[rdx+r11+CONST]
[r10+r10]
[r11+r11]
[rax+r11+CONST]
[rax+rsi*4+CONST]
[r10+CONST_VAR+CONST]
[r14+r11]
[rsp+r12*8+CONST+var_xxx]
[rbp+CONST_VAR+var_xxx]
[rsp+rbx*8+CONST+var_xxx]
[rsp+rcx*8+CONST+var_xxx]
[r15+rdi*8]
[rbp+rcx+var_xxx]
[rbp+rax+var_xxx+CONST]
leave
rdsspq
incsspq
[rbx+r8*8+CONST]
[r11+r10]
pmuludq
psllq
[r8+r12*4]
[CONST_VAR+r12*4]
[rsp+rbp*8+CONST+var_xxx]
[r10+r11*8]
[r10+r8*8]
[rsp+CONST_VAR+CONST+var_xxx+CONST]
[rsp+r8+CONST+var_xxx+CONST]
[rsp+r11+CONST+var_xxx]
[rsp+r11+CONST+var_xxx+CONST]
[rsp+r12+CONST+var_xxx+CONST]
[rsp+rdx+CONST+var_xxx+CONST]
[rsp+rdi*8+CONST+var_xxx+CONST]
[rsp+r11*8+CONST+var_xxx+CONST]
[rsp+CONST_VAR+var_xxx]
[r15+rdx*4+CONST]
[r8+r12*8]
[r8+r11*8+CONST]
[CONST_VAR+r8*4+CONST]
[rsp+rsi*4+CONST+var_xxx]
[rsp+rdi*8+CONST+var_xxx]
[r9+rbx*8]
[r12+rbp+CONST]
[r9+r15+CONST]
[rbp+r11+CONST]
cmplesd
[rcx+r13*8]
[rax+r8*4+CONST]
[rsp+rdi*4+CONST+var_xxx]
[rsp+rdx*4+CONST+var_xxx]
[r14+rax*4+CONST]
movsb
[r9+rcx*2]
[r9+rsi*2]
[rbx+rbx*2+CONST]
[r15+rbp*4+CONST]
cvttpd2dq
[r14+r14*2+CONST]
[r8+r10*8+CONST]
[r14+rdi*8+CONST]
[rbp+rcx*2+CONST]
[r12+rcx*2]
[r10+rsi*4+CONST]
[r11+rdx]
[r11+rcx+CONST]
[rcx+r9*4+CONST]
[r8+r13+CONST]
[rsp+rsi*4+CONST+var_xxx+CONST]
cvtdq2ps
ror
[r8+rdx*8+CONST]
psrlq
[rcx+r11*8]
[rdx+r10*8]
[rax+rdi*4+CONST]
[rdx+r15*4]
cmpnltss
[r15+r13+CONST]
[rax+r8*8+CONST]
[r13+r12*2+CONST]
[r10+rcx*4]
pcmpgtw
[rbx+r9*8+CONST]
[rdx+r8*2+CONST]
[rsp+r15+CONST+CONST_VAR]
[rsp+r13+CONST+CONST_VAR]
[r10+rsi*8+CONST]
[r14+rax*2]
[rax+r13*2+CONST]
[rdx+rdi*2+CONST]
[rbx+r9]
[r11+r15]
[rdx+r13*8+CONST]
[rbp+r15*2+CONST]
[r12+r10*8+CONST]
[rbx+rdi*8]
[CONST_VAR+rdi*8+CONST]
[r14+rdx*8+CONST]
[r8+r12*8+CONST]
[r10+r12*4]
[r10+rbp*4]
[r9+r11*4]
[r12+rdi*8+CONST]
[r14+r10*4]
[rbp+r13*4+CONST]
[r12+r15*4]
[r11+r9*4]
[r11+r11*2+CONST]
[rax+r12*2+CONST]
[r15+rax*2]
[r11+rbp*4]
[r11+r12*4]
[rsp+rcx*4+CONST+var_xxx]
[rcx+r14+CONST]
[rsp+rbx*4+CONST+var_xxx]
[rbp+rbx*8+var_xxx]
[rbp+r12*8+var_xxx]
[rsp+r13*8+CONST+var_xxx]
[r9+r11*8+CONST]
[rsp+r14*8+CONST+var_xxx]
[r10+rdi*8+CONST]
[r10+rbx*8+CONST]
[r9+rbp*8+CONST]
[r8+r14*8+CONST]
[r10+r15*8+CONST]
[r10+rcx*4+CONST]
[r10+rdx*4+CONST]
[r11+rbx]
[r12+rdi*4]
[r12+r14*4]
[r15+r12*8]
[r11+rdx*2]
[rbx+rdi*8+CONST]
[r11+r15*8+CONST]
[r9+r10*8+CONST]
[r10+r10*8]
[r9+r9*8]
[r11+r11*8]
[r9+r13*8]
[r12+r10*8]
[rbx+rbx*8]
[r15+r11*4]
divps
[rbp+r14*4+CONST]
[rbx+r15*4]
[r14+r10+CONST]
[rbx+r10*4]
[r9+rdx*4+CONST]
[r15+r11*8]
[r10+r11*4]
[r10+r8*4]
[rsp+r15*8+CONST+arg_xxx]
[r13+r9*8+CONST]
[r11+r8*4]
clc
[r11+rdi*4]
[r11+r12*8]
[CONST_VAR+r12*4+CONST]
[rdx+r12*4+CONST]
[rax+r10*4+CONST]
[rax+r15*4+CONST]
[r10+rdx+CONST]
[r12+r12*8]
[rax+r13*4+CONST]
[rcx+rbp*4+CONST]
[CONST_VAR+r14*4+CONST]
[rcx+rbp*8+CONST]
[rbp+rbp*8+CONST]
[r13+r10*8+CONST]
[r11+r10+CONST]
[r15+rax*2+CONST]
[r10+rbp]
pmullw
[r10+r9]
[r12+r8*4]
[r12+rbx*2]
[r12+r8*2]
[r12+r14*2]
[r12+rdx*2]
[r13+r8*2+CONST]
[r13+r14*2+CONST]
[r12+rax*2]
[r10+r13*8]
cmpltpd
[r10+rdi*4+CONST]
[rsp+r10*4+CONST+var_xxx]
[rsp+r9*4+CONST+var_xxx]
[rsp+r15*4+CONST+var_xxx]
[rax+r15*8+CONST]
[r9+rbp]
[r15+r11]
[r10+r11]
[rdx+rbx*2]
[rdx+r13*2]
[rdx+r11*2]
[rdx+r12*2]
[rdx+r14*2]
[rdx+rbp*2]
[r11+rbp*2]
[r11+rsi*2]
[r11+r10*2]
[rbx+r14*2]
[r15+r10*2]
[r13+r15*2+CONST]
[r14+r15*2]
[rbx+r11*2]
[CONST_VAR+rbp*2]
[CONST_VAR+r10*2]
[CONST_VAR+r11*2]
[r11+r13*8+CONST]
[rdx+r12*8+CONST]
[r9+r8*4]
[r14+r8+CONST]
[r14+r9*8]
[r8+rcx*4+CONST]
[rsp+rdx*4+CONST+CONST_VAR]
[r8+r13*8]
[rax+rdi*8+CONST]
[r14+rbp+CONST]
[r15+rbp*2]
[rdx+r14*4+CONST]
[rcx+r14*4+CONST]
[rbx+r13*2]
[rbp+r10*4+CONST]
[r8+rsi*2]
[r8+rdi*4]
pause
[r11+rbx*4]
[r10+rbx*4]
[rax+r9*4+CONST]
maxps
[r14+rbx*4+CONST]
[r8+r9*8+CONST]
[r15+r11*4+CONST]
[r15+rdi*4+CONST]
[r15+r10*4+CONST]
[r15+r8*4+CONST]
[r10+rax*2]
[r15+rdx*2]
[r14+r10*8]
[r15+r9*4]
[r11+r8+CONST]
[r8+r11+CONST]
[r8+rbx+CONST]
[r13+r11*8+CONST]
[CONST_VAR+r11+CONST]
[rax+r8*2]
[rbx+rbp*2]
[r15+r15+CONST]
[r14+rbp*2]
[rbx+r12*2]
[rax+r12*2]
+24h
+48h
[rdx+rbp+CONST]
[r15+r15*8]
[r13+r13*8+CONST]
[rbx+r15*2]
rdtsc
[rdx+r8*2]
[rsp]
[r15+r8*8+CONST]
[r15+rdi*8+CONST]
[rcx+r8*8+CONST]
[r15+r9+CONST]
[rsp+r14+CONST+CONST_VAR]
fsubr
[rdx+rbp*2+CONST]
[r15+rdx*2+CONST]
[r14+rbx*2+CONST]
[r14+r9*8+CONST]
[r10+r9*8+CONST]
[r14+r13*2]
[rdx+rdi*8+CONST]
[r14+rdx*2]
[r9+r14*4]
[r9+rdi*8+CONST]
psubusb
[r10+r15*8]
[rsp+r15*8+CONST+var_xxx]
[r12+r11*8+CONST]
[r12+r8*8+CONST]
[r12+r9*8+CONST]
[r10+r14+CONST]
[r8+r15*8]
[CONST_VAR+r15*8+CONST]
[rdx+r15*8+CONST]
[r10+rbp*8]
cbw
[rbx+rbp*4+CONST]
[rbx+r15*4+CONST]
[r9+rdi*4+CONST]
[rdx+rbx*2+CONST]
[rcx+r11+CONST]
cmpltss
[r10+r9*4]
[r9+r14*8]
esp
[rdx+rdi*4+CONST]
[r11+r10*4]
[r15+r8+CONST]
[r15+r10+CONST]
[r15+rcx*2]
[r14+r11+CONST]
cmpneqpd
cmpeqpd
cmpneqps
cmpeqps
[rbx+r9*4]
[rbx+rsi*2]
[rbx+rsi*2+CONST]
[r14+r8*8+CONST]
[rsp+r9+CONST+var_xxx]
[r15+r8*8]
[r11+r8*8+CONST]
[rsp+rbx*8+CONST+var_xxx+CONST]
[CONST_VAR+r14*2]
[rbp+r12*2+CONST]
[CONST_VAR+r13*2]
[CONST_VAR+r12*2]
[r11+r12*2]
[CONST_VAR+rbx*2]
[rbx+rdi*2]
[rbp+r14*2+CONST]
[r9+r13]
[r9+rcx*2+CONST]
[rsp+r12*2+arg_xxx]
[rsp+rcx*2+arg_xxx]
[rsp+rsi*2+arg_xxx]
[rsp+rcx+arg_xxx]
[rsp+CONST_VAR+arg_xxx]
[rsp+rbx*2+arg_xxx]
[rsp+rdx+arg_xxx]
xgetbv
cpuid
[rsp+r10+CONST+var_xxx]
[rsp+rbx*2+CONST+var_xxx]
[rcx+r8*2+CONST]
[r10+rsi*2]
[rsp+rcx+CONST]
[rsp+CONST_VAR+CONST]
[rsp+rax+CONST]
[rsp+rsi*2+CONST+var_xxx]
[CONST_VAR+r10*2+CONST]
[rsp+rdx+CONST]
[CONST_VAR+r11*4+CONST]
[rbp+rax+CONST_VAR]
[rbp+rdx+CONST_VAR]
[rsp+rcx+CONST+var_xxx+CONST]
[rax+rax*8+CONST]
[rsp+rcx+CONST+CONST_VAR]
[rdx+r14*2+CONST]
[r15+r13*2]
[r15+rbp*2+CONST]
[rax+r15*2+CONST]
[r15+r13*2+CONST]
[rax+r9*8+CONST]
[rax+r14*4+CONST]
[rdx+r10*8+CONST]
[r15+rbx*2]
[r10+rdx*2+CONST]
[r10+rdx*2]
[r12+rbp*2+CONST]
[r12+r8*2+CONST]
[rbx+r8*2+CONST]
[rbx+r10*2]
[rbp+rax+CONST_VAR+CONST]
[rbp+rdx+CONST_VAR+CONST]
[r13+rcx*2+CONST]
[r14+rcx*2]
[r12+rsi*2]
[rsp+r15*2+CONST+var_xxx]
[r8+r12*2+CONST]
[r8+r14*2+CONST]
[CONST_VAR+r13*2+CONST]
[CONST_VAR+rbx*2+CONST]
[rbx+r13*2+CONST]
[r11+r13*4]
psadbw
[r11+rax*2]
[r9+r14+CONST]
[rsp+rax*4+CONST+CONST_VAR]
[rsp+r15+CONST+var_xxx+CONST]
[rsp+r13+CONST]
[rsp+rbp+CONST]
[rsp+rbx+CONST+var_xxx+CONST]
[rsp+r12+CONST]
[rcx+r13*2+CONST]
[rcx+r13*2]
[rsp+r14+CONST+var_xxx+CONST]
[r11+rbp]
[r11+r9+CONST]
[r10+r15+CONST]
[rsp+rbp+CONST+CONST_VAR]
[rsp+rax+CONST+CONST_VAR+CONST]
[rsp+r9+CONST+CONST_VAR]
[rsp+rbx+CONST+CONST_VAR+CONST]
[r8+rbp+CONST]
[rsp+rax*2+CONST+var_xxx]
[rsp+r8*2+CONST+var_xxx]
[rsp+rcx*2+CONST+var_xxx]
[rsp+rdi*2+CONST+var_xxx]
[rsp+rdx*2+CONST+var_xxx]
[rsp+rbp*2+CONST+var_xxx]
[rbp+r8+var_xxx]
[r12+rdx*2+CONST]
[r8+r12+CONST]
[rsp+rbp+CONST+var_xxx+CONST]
[rsp+r8+CONST+CONST_VAR+CONST]
[r12+r10+CONST]
[r15+rsi*2]
[rbx+r14*2+CONST]
[r14+r9+CONST]
[rdx+r10*2]
[rsp+rdx*2+CONST+var_xxx+CONST]
[rsp+r10*2+CONST+var_xxx]
[rdx+r9*2]
[rsp+r12*2+CONST+var_xxx]
[r10+rbx*2]
[rsp+r14*2+CONST+var_xxx]
[rsp+r15*2+CONST+var_xxx+CONST]
[rsp+r13*2+CONST+var_xxx]
[r11+r14]
[r10+r9*2]
[rsp+r10*8+CONST+var_xxx]
[CONST_VAR+rdi*4+CONST]
cmovp
[rbp+r14*8+var_xxx]
[CONST_VAR+r10*4+CONST]
[rbp+r11*8+var_xxx]
vpcmpeqd
vmovdqa
vpxor
popcnt
vpor
vpand
vpandn
vmovq
vpextrq
ymm1
vandps
ymm0
vzeroupper
vorps
ymm2
ymm4
ymm5
ymm3
ymm6
ymm7
ymm9
ymm8
vextracti128
vpternlogd
zmm0
vmovdqa32
zmm1
zmm2
zmm5
vpxord
zmm4
vpord
zmm6
vpandd
zmm3
zmm7
zmm8
zmm9
vpandnd
[CONST_VAR+rbp*2+CONST]
[rax+rbp*4+CONST]
[r14+r13*4+CONST]
[r8+rsi*4+CONST]
[rdx+r9*8+CONST]
[r10+r11*8+CONST]
[r11+r15*4]
[r11+rbx+CONST]
[r12+r11+CONST]
[r12+r9+CONST]
[r14+rbx*2]
[rbp+rdx*2+CONST]
[rsp+rax*4+var_xxx]
[r8+rdi*4+CONST]
[r8+r13*4+CONST]
[r8+r15*4+CONST]
[r8+r14*4+CONST]
[CONST_VAR+rbp*8+CONST]
[r9+r15*8]
[r11+r14+CONST]
[rdx+r11*8+CONST]
[rax+r11*8+CONST]
[r15+rdi*2]
[rbp+rdi*2+CONST]
[rbp+rsi*2+CONST]
cmpless
[r14+r13*2+CONST]
[rbx+r15*2+CONST]
[rax+r11*2]
cmpleps
[r14+r12*2]
[r15+r12*2]
[r9+rbp*8]
[CONST_VAR+r9*4+CONST]
[r12+rbx*2+CONST]
[rsp+rdx*8+CONST+CONST_VAR]
[r13+rbp*2+CONST]
[rsp+rdi*8+CONST+CONST_VAR]
[rsp+r14*8+CONST+CONST_VAR]
[rdx+rbx*4+CONST]
[rcx+rdi*8+CONST]
[r9+r11*2]
[r9+r8*2]
[r8+r9*2]
[r8+r9*4+CONST]
psubw
[r10+rcx*2]
[rsp+r8*8+CONST+var_xxx]
[rsp+r9*8+CONST+var_xxx]
[rsp+r11*8+CONST+var_xxx]
fyl2x
fldl2e
frndint
f2xm1
faddp
fscale
cvtsd2si
fldln2
fldlg2
fsin
fcos
fptan
int
fpatan
[r14+rdx*4+CONST]
tzcnt
[rdx+r9*4+CONST]
[r9+r10*4+CONST]
[edi]
[rbp+r8*2+CONST]
[rdx+r15*2]
[rbx+rdx*2+CONST]
[CONST_VAR+r14*2+CONST]
[rax+r14*2+CONST]
[r15+r9*2]
[r11+rax*2+CONST]
[rsp+rdi*2+CONST+var_xxx+CONST]
[r11+rdi*8+CONST]
[r11+rsi*8+CONST]
[rbx+rbp*2+CONST]
[r12+r8+CONST]
[r14+rdx*2+CONST]
[rbx+rcx*2+CONST]
[esi]
[rbx+r11*8]
[r15+r15*2+CONST]
[r15+r14*4+CONST]
[rsp+r14*4+CONST+var_xxx+CONST]
[r11+rdi*4+CONST]
[r11+rbx*4+CONST]
[r9+rsi*4+CONST]
[rdx+r8*4+CONST]
[rcx+rsi*2]
cmovnp
[r10+rax*2+CONST]
[r15+r14*2+CONST]
bnd
[rsp+r8*8+CONST+CONST_VAR]
[rbp+r9*2+CONST]
[r11+r9*2]
[rsp+rbp*4+CONST+var_xxx]
[r10+rdi*2]
[r10+rbp*2]
[r11+r8*2]
[r10+r8*2]
[r11+rcx*2]
[r9+rcx*4+CONST]
[r14+rcx*4+CONST]
[rsp+rax+var_xxx]
[rcx+r8*2]
[rcx+r12*2]
[r12+r15*2]
[r14+r10*4+CONST]
[rbx+r8*2]
[rax+r10*2]
[r10+r10+CONST]
[r9+rdi*2]
[r9+rbp*2]
[r8+r11*2]
[rcx+r15*2]
[r8+r15*2]
[CONST_VAR+r15*4+CONST]
[rcx+r11*2]
[r10+rbx*2+CONST]
[rbx+r9*2]
[r10+rdi*2+CONST]
[rcx+r9*2]
[r10+r9*2+CONST]
[r8+rdi*2]
[r10+r14*4]
[r14+r11*4]
[r14+rdi*4]
[r14+rsi*4+CONST]
[r9+r12+CONST]
[r8+r15+CONST]
[r15+rbx*2+CONST]
[rsp+r12+CONST+CONST_VAR]
[r10+rbx*8]
[rdx+rdx*4+CONST]
fild
[r8+r8*4+CONST]
fadd
[rbx+rbx*4+CONST]
[r10+r11*2]
pmaddwd
[r9+rbx*2]
[r14+r9*2]
[r12+r10*2]
[r12+r9*2]
[rdx+r9*2+CONST]
[rsp+rax*8+CONST+arg_xxx]
[r11+r9*4+CONST]
[r10+r9*4+CONST]
[r11+r12*8+CONST]
[rax+r12*4+CONST]
[CONST_VAR+r13*4+CONST]
[r9+rbx*4+CONST]
+3
[r12+rbp*4+CONST]
[r15+r9*8+CONST]
[r11+r9*8+CONST]
[rbx+r10*8+CONST]
[r9+r9*2+CONST]
[rsp+r11*4+CONST+var_xxx]
[r9+r8*8+CONST]
[r14+r11*8+CONST]
[rdx+rbp*4+CONST]
[rsp+rax*4+CONST+var_xxx+CONST]
[rsp+rax*8+CONST+var_xxx+CONST]
[rsp+rcx*4+CONST+var_xxx+CONST]
[rsp+rdx*8+CONST+var_xxx+CONST]
[rsp+rdx*4+CONST+var_xxx+CONST]
[rsp+rbp*8+CONST+var_xxx+CONST]
[r10+r10*2+CONST]
[CONST_VAR+r15*2+CONST]
[rbp+rdx*4+var_xxx]
[rbp+rdi*4+var_xxx]
[rbp+r8*8+var_xxx]
[rbp+r11+var_xxx]
[rbp+rax*4+var_xxx]
[rbp+rsi*4+var_xxx]
[rbp+r13+var_xxx]
[r11+r10*4+CONST]
[r11+r10*2+CONST]
[r11+r8*4+CONST]
[r13+r10*2+CONST]
[r11+r8*2+CONST]
[CONST_VAR+rbx*4+CONST]
[rbx+rdi*2+CONST]
[r10+rcx*2+CONST]
[r13+rsi*2+CONST]
[rsp+rbp*8+CONST+CONST_VAR]
[rsp+rbx*4+CONST+var_xxx+CONST]
[rsp+r12*4+CONST+var_xxx]
[rsp+r12*4+CONST+var_xxx+CONST]
[rcx+r12*4+CONST]
minpd
maxpd
[rbp+r10*8+CONST]
[rsp+r9*8+CONST+CONST_VAR]
[rsp+rsi*8+CONST+CONST_VAR]
+10h
[r9+rsi*8+CONST]
[rbp+r13*2+CONST]
[rdx+r13*4+CONST]
+0Ch
bsf
[rbx+r12*2+CONST]
[r14+rcx*2+CONST]
[r9+rax*2+CONST]
[rcx+r10*4+CONST]
[r12+r8*4+CONST]
[r12+r9*4+CONST]
[rcx+r11*4+CONST]
[rsp+r9*2+CONST+var_xxx]
[r14+r9*2+CONST]
[r14+r8*2]
[r14+r8*2+CONST]
[r14+r10*2]
[r14+r10*2+CONST]
[r14+r11*2]
[r14+r11*2+CONST]
emms
[r12+rbp*2]
[r14+rsi*2+CONST]
[CONST_VAR+r12*2+CONST]
[r13+r9*2+CONST]
[r9+rdi*2+CONST]
[r9+r11*2+CONST]
[r9+r15*2+CONST]
[rsp+r11*2+CONST+var_xxx]
[r9+rbx*2+CONST]
[rsp+rbx*2+CONST_VAR+var_xxx]
[rsp+r10*2+CONST_VAR+var_xxx]
[rsp+r8*2+CONST_VAR+var_xxx]
[rsp+rax*2+CONST_VAR+var_xxx]
[r15+r8*2]
[r8+r10*4+CONST]
[r11+rcx*8+CONST]
[r10+r13+CONST]
[r10+r8+CONST]
[rcx+rbx*4+CONST]
[rcx+rdi*2+CONST]
[r12+rcx*2+CONST]
[r12+rsi*2+CONST]
[rsp+r8+CONST+CONST_VAR]
[r11+r15*8]
seto
[rdx+r12*2+CONST]
[rcx+r12*2+CONST]
[r10+r15*4]
[r11+r12+CONST]
[rsp+CONST_VAR+var_xxx+CONST_VAR]
[rsp+CONST_VAR+CONST_VAR]
[r11+r14*8]
shld
[rsp+rdx*8+CONST+arg_xxx]
[r14+r15*4+CONST]
[r10+r8*4+CONST]
[rsp+rax*4+CONST+arg_xxx]
[rsp+rdx*4+CONST+arg_xxx]
[rsp+rbp*4+CONST+CONST_VAR]
[rsp+r10+CONST+arg_xxx]
[rsp+r9*4+CONST+arg_xxx]
[rsp+rax+CONST+arg_xxx]
[r8+r14*8]
[rbp+r9+var_xxx]
[rbp+r10+var_xxx]
[r9+r15*4+CONST]
[r14+r12*4+CONST]
[r11+rbx*2]
[r11+rbx*2+CONST]
[r11+rdi*2]
[r8+r14*2]
[CONST_VAR+r15*2]
[r9+r15*2]
[rbp+r11*8+CONST]
[r8+r10*2+CONST]
[rcx+r11*2+CONST]
[r10+r8*2+CONST]
minps
[r8+r13*2]
[r8+r13*2+CONST]
[r11+rdx*2+CONST]
[r8+rbx*2]
[rbx+r13*4+CONST]
[r12+r14*2+CONST]
[r8+rbp*4+CONST]
[r12+rdi*2]
[rbp+r10*2+CONST]
[r8+rbp*2]
[r14+rdi*2]
[r12+r13*2]
[r9+r9*4+CONST]
[rdx+r10*4+CONST]
[r9+r8*2+CONST]
[rbp+r13*4+var_xxx]
[r14+r15*2+CONST]
[rbp+r11*2+CONST]
[r12+rdi*2+CONST]
[rbp+rcx*4+var_xxx]
[r9+r9*8+CONST]
[rcx+rcx*8+CONST]
[rbp+r13*8+var_xxx]
[rbp+r15*4+var_xxx+CONST]
[r14+rbp*4+CONST]
spl
prefetcht0
[rcx+r11*8+CONST]
[rdx+r15*4+CONST]
[rbx+r9*4+CONST]
vmovdqu
vpinsrq
vmovsd
vpbroadcastq
vxorps
vcvtusi2sd
vdivsd
vcvtsi2sd
rorx
vxorpd
vmovupd
vmovss
vcvtusi2ss
vmulss
vcvtss2sd
vdivss
vcvttss2usi
vcvtsd2ss
vucomisd
kmovb
k1
k2
kandb
k0
kortestb
vinserti128
movbe
vmovd
vpinsrd
vmovdqu64
vcomiss
[r9+rdx*2+CONST]
vpmovsxdq
vmulsd
vpbroadcastd
vpaddq
vpaddd
vmovdqa64
vextracti64x4
vextracti32x8
vextracti64x2
vpextrd
vaddsd
[r13+CONST_VAR]
shlx
vcvttps2dq
vpermt2w
vpmovwb
vinserti64x4
vmovdqu8
vpbroadcastw
vpackuswb
vpermq
vcvttss2si
vbroadcastss
vaddps
vpermi2w
vaddss
vmovdqu16
vmovaps
vmovdqu32
vsubsd
vfmadd231ps
vfmadd231ss
vfmadd213ss
vfnmadd213ss
vfmsub231ss
vcmpordss
vblendvps
vcmpunordss
vunpcklps
vmovlps
vucomiss
shrx
vshufpd
vminps
vmaxps
vshufps
vdivps
vcvtsi2ss
vsubps
vmulps
vfmsub132ps
vsqrtps
vpsubq
vpsrlq
vpminuq
vcomisd
vcvttsd2usi
vandpd
[rbp+rdx+var_xxx+CONST]
vmovups
vmovsldup
vmovshdup
vfmadd132ss
vsqrtss
vsubss
vpunpcklqdq
vfmadd132ps
vpermt2ps
vpermi2ps
vpmullq
vmaxsd
andn
[rdx+rdx*8+CONST]
shrd
fxam
fnstsw
[rsp+r9+CONST+var_xxx+CONST]
[r13+rdi*2+CONST]
[rbp+rcx+arg_xxx]
[rsp+r10+CONST+var_xxx+CONST]
[r9+r12*4+CONST]
rdrand
rdseed
+28h
[rax+r11*2+CONST]
[r12+r10*4+CONST]
[r14+r11*4+CONST]
[rdx+r15*2+CONST]
[rcx+r10*2]
[rcx+r14*2]
[r10+rsi*2+CONST]
[rbp+rax*4+CONST_VAR]
[rbp+rcx*4+CONST_VAR]
syscall
[r13+r11*2+CONST]
[rsp+r13*8+CONST+CONST_VAR]
[rsp+rdi*8+CONST+arg_xxx]
[rsp+rsi*8+CONST+arg_xxx]
[rsp+r14*8+CONST+arg_xxx]
[rsp+r8*8+CONST+arg_xxx]
[rsp+r13*8+CONST+arg_xxx]
[r15+r15*4+CONST]
[rax+r9*2+CONST]
[rbx+rbx*8+CONST]
[rbp+arg_xxx+CONST]
[r15+r14*2]
[CONST_VAR+rbp*4+CONST]
pmulhw
psraw
packssdw
[r8+r11*2+CONST]
pmulhuw
[rbx+r9*2+CONST]
[rbx+r10*2+CONST]
[r9+r11*4+CONST]
[r15+r12*4+CONST]
[rbp+r15*8+var_xxx]
[rbp+r15*8+var_xxx+CONST]
[rbp+rax*4+var_xxx+CONST]
[rbp+rcx*4+var_xxx+CONST]
[rsp+rbx+CONST+arg_xxx]
[rsp+r13+CONST+var_xxx+CONST]
[rsp+rax*2+arg_xxx]
[rsp+rdx*2+arg_xxx]
[r15+r11*2]
[rsp+rbp*2+CONST+var_xxx+CONST]
[r8+r15*2+CONST]
[r14+r12*2+CONST]
[rsp+rax+CONST+arg_xxx+CONST]
[rsp+r15+CONST]
[rsp+r8*4+CONST+CONST_VAR]
[rsp+r10*4+CONST+CONST_VAR]
[rsp+rbx+CONST]
[rcx+r15*4+CONST]
[r11+rdx*4+CONST]
[rsp+rcx*8+CONST+var_xxx+CONST]
[r10+r12*8]
[rsp+rdi*8+arg_xxx]
[rsp+rax*8+arg_xxx]
[r15+r11*8+CONST]
[rbp+r8*4+var_xxx]
[rsp+rax*4+CONST+CONST_VAR+CONST]
[rsp+rdx*4+CONST+CONST_VAR+CONST]
[rsp+rsi*4+CONST+arg_xxx]
[rsp+rax*4+CONST+arg_xxx+CONST]
[rsp+r9*4+CONST+arg_xxx+CONST]
[rcx+r9*8+CONST]
[rsp+r10*8+CONST+CONST_VAR]
[rsp+r11*8+CONST+CONST_VAR]
[rsp+r15*8+CONST+CONST_VAR]
[rsp+rbx*8+CONST+CONST_VAR]
[rsp+r12*8+CONST+CONST_VAR]
[r15+r10*8+CONST]
[rbp+r14*4+var_xxx]
[rcx+r10*8+CONST]
[rsp+r8*4+CONST+arg_xxx+CONST]
[rbp+rax*8+CONST_VAR]
[r8+r8*8+CONST]
[rbp+rbx+var_xxx+CONST]
[r10+r11*4+CONST]
[rsp+rbx*4+CONST+CONST_VAR]
[rsp+rbp*4+CONST_VAR]
+50h
[r15+r9*4+CONST]
[rcx+rbx*2+CONST]
[rsp+r10*8+CONST+var_xxx+CONST]
[rsp+r9*8+CONST+var_xxx+CONST]
[rsp+rsi*8+CONST+var_xxx+CONST]
[r15+rcx*2+CONST]
[r15+rsi*2+CONST]
[rsp+rbx*8+CONST+arg_xxx]
[r11+rsi*4+CONST]
[rsp+rax*2+CONST+var_xxx+CONST]
[r14+rdi*2+CONST]
[r15+r12*2+CONST]
[rbx+r11*8+CONST]
[r9+rsi*2+CONST]
[rbp+rax*2+var_xxx]
[rsp+CONST_VAR+CONST+arg_xxx]
[rsp+rdx+CONST+arg_xxx]
[r11+rbp*4+CONST]
[r11+r13*2]
[r13+rax+CONST_VAR]
[r11+r15*2]
sin
[r9+r13*4+CONST]
setns
std
[rsp+rax*4+CONST]
[r11+rcx*2+CONST]
[rsp+r9*8+CONST+arg_xxx]
[rsp+r9+CONST+arg_xxx]
[rbp+rcx+var_xxx+CONST]
[rbp+r9*8+var_xxx]
[rbp+r12*4+var_xxx]
[rsp+rbp+var_xxx]
[rbp+r12+var_xxx]
[rsp+rbp*4+CONST+var_xxx+CONST]
kmovd
[rsp+r14*2+CONST+var_xxx+CONST]
korb
kmovq
k3
knotq
k4
k5
k6
k7
[rbp+rbx+var_xxx]
enter
[r8+rbp*2+CONST]
[rsp+r13+CONST+arg_xxx]
[rsp+rdx*8+CONST]
[rsp+rdx*8+arg_xxx]
[r12+r15*2+CONST]
[rax+r11*4+CONST]
[rbp+rbx*4+var_xxx]
[rsp+rbx*2+CONST+CONST_VAR]
[rsp+rbx+CONST+arg_xxx+CONST]
[r9+r12*2]
[r9+r14*2+CONST]
[rsp+rcx*4+CONST+CONST_VAR]
[rsp+rsi*2+CONST+var_xxx+CONST]
[rsp+rcx+var_xxx]
[rsp+rax+var_xxx+CONST]
[r14+rbp*2+CONST]
[rbp+rdi*8+var_xxx]
[rbp+r10*8+var_xxx]
[r14+rdi*4+CONST]
[rbp+r15*4+var_xxx]
[r8+r11*4+CONST]
[rsp+rbx*8+CONST+CONST_VAR+CONST]
[r15+r9*2+CONST]
[rdx+r11*2+CONST]
[r15+r10*2+CONST]
[r10+r14*2]
[rcx+r9*2+CONST]
[rbp+rbx*8+CONST_VAR]
fsubp
[rbp+rdx*8+CONST_VAR]
[rbp+rdx*2+var_xxx]
[rbp+rdx*4+CONST_VAR]
[rbp+rax*2+CONST_VAR]
+14h
[rbp+rcx+CONST_VAR]
[rbp+rdx*4+var_xxx+CONST]
+0Ah
[rbp+rax*8+var_xxx+CONST]
a3
a46
vmovlhps
mm1
mm5
cmpnleps
[rcx+r13*4+CONST]
[rsp+rcx*2+CONST+var_xxx+CONST]
[r9+r12*2+CONST]
[r8+rbx*4+CONST]
[rbp+rbx*2+var_xxx]
movsq
movsw
[rdx+r11*4+CONST]
[r15+rdi*2+CONST]
[r15+r11*2+CONST]
[rcx+rbp*2+CONST]
[rcx+r14*2+CONST]
rcr
[rsp+r14*8+CONST+var_xxx+CONST]
[rcx+r10*2+CONST]
[rbp+r8+var_xxx+CONST]
[r15+r8*2+CONST]
[r14+r9*4+CONST]
[rsp+r15*4+CONST+var_xxx+CONST]
[rbp+r14+var_xxx]
[rbp+r14+var_xxx+CONST]
[rbp+r15+var_xxx]
[rsp+r8*4+CONST+var_xxx+CONST]
[r12+r10*2+CONST]
+8
xlat
[r8+rdi*2+CONST]
[rsp+rdx+var_xxx]
[rbp+r10*8+var_xxx+CONST]
[rsp+rbp+CONST+arg_xxx]
[rbp+rdx*2+var_xxx+CONST]
[rsp+r13*2+CONST+var_xxx+CONST]
[r11+rsi*2+CONST]
[r14+r14*8+CONST]
[rbp+r9*4+var_xxx]
dest
[r12+r11*2]
[rbx+r11*2+CONST]
[r11+r12*2+CONST]
[r11+r9*2+CONST]
[rcx+r15*2+CONST]
[r11+rdi*2+CONST]
[rsp+rax*2+CONST+CONST_VAR]
[rsp+rdi*2+CONST+CONST_VAR]
[rsp+rsi*2+CONST+CONST_VAR]
[r9+r13*2]
[rbp+rdx*8+var_xxx+CONST]
JUMP_ADDR_EXCEEDED
UNK_JUMP_ADDR
